package by.auditsalution.selection.model;

import lombok.Getter;

@Getter
public enum Account {

    A01("01"), // дебет
    A08("08"), // дебет
    A07("07"), // дебет
    A02("02"), // кредит
    A03("03"), // дебет
    A04("04"), // дебет
    A05("05"), // кредит
    A06("06"),// дебет
    A09("09"),// дебет
    A10("10"), // дебет
    A11("11"), // дебет
    A14("14"), // дебет
    A15("15"), // кредит
    A16("16"),  // дебет
    A18("18"), // дебет
    A20("20"), // дебет
    A21("21"), // дебет
    A23("23"), // дебет
    A25("25"), // дебет
    A26("26"), // дебет
    A28("28"), // дебет
    A29("29"), // дебет
    A41("41"), // дебет
    A42_1("42.1"), // кредит
    A42_3("42.3"), // кредит
    A43("43"), // дебет
    A44("44"),  // дебет
    A47("47"),  // дебет
    A50("50"),  // дебет
    A51("51"),  // дебет
    A52("52"),  // дебет
    A55("55"),  // дебет
    A57("57"),  // дебет
    A58("58"),  // дебет
    A60("60"),  // дебет/кредит
    A62("62"), // дебет/кредит
    A63("63"), // кредит
    A65("65"), // кредит
    A66("66"), // дебет/кредит
    A67("67"), // дебет/кредит
    A68_1_1("68.1.1"), // дебет/кредит
    A68_2_1("68.2.1"), // дебет/кредит
    A68_3_1("68.3.1"), // дебет/кредит
    A68_3_2("68.3.2"), // дебет/кредит
    A68_3_3("68.3.3"), // дебет/кредит
    A68_3_4("68.3.4"), // дебет/кредит
    A68_3_5("68.3.5"), // дебет/кредит
    A68_4_1("68.4.1"), // дебет/кредит
    A68_5_1("68.5.1"), // дебет/кредит
    A68_5_2("68.5.2"), // дебет/кредит
    A68_5_3("68.5.3"), // дебет/кредит
    A68_5_4("68.5.4"), // дебет/кредит
    A69("69"), // дебет/кредит
    A70("70"), // дебет/кредит
    A71("71"), // дебет/кредит
    A73("73"), // дебет/кредит
    A75("75"), // дебет/кредит
    A76("76"), // дебет/кредит
    A79("79"), // дебет/кредит
    A80("80"), // кредит
    A82("82"), // кредит
    A83("83"), // кредит
    A84("84"), // дебет/кредит
    A86("86"), // кредит
    A96("96"), // дебет
    A97("97"), // дебет
    A98("98"), // кредит
    A94("94"), // дебет
    A90_1("90.1"),
    A90_2("90.2"),
    A90_4("90.4"),
    A90_5("90.5"),
    A90_6("90.6"),
    A90_7("90.7"),
    A90_8("90.8"),
    A90_10("90.10"),
    A91_1("91.1"),
    A91_2("91.2"),
    A91_3("91.3"),
    A91_4("91.4");

    private String value;
    Account(String value){
        this.value = value;
    }

}
